# Pandas Exercise
Use the Adventure Works dataset to create the following reports.
The data files can be directlty accessed by all users on ARC (our Hadoop Cluster).

***No need to download or copy into your home directory!***

Reference to the original data set https://msdn.microsoft.com/en-us/library/hh403424.aspx 

## Task
1. write the Python Pandas expression to produce a table as described in the problem statements.
2. The SQL expression may give you a hint. It also allows you to see both systems side-by-side.
3. If you don't know SQL just ignore the SQL code.

In [1]:
import pandas as pd
import numpy as np

Employees = pd.read_excel('/Users/mxz0434/GSU-Teaching/course-material/DataProgramming/04-Pandas-Data-Tables/Employees.xls')

# Filtering (with)

### 1. Provide a list of employees that are married.

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
    WHERE e.MaritalStatus = 'M';

In [ ]:
Employees.MaritalStatus == 'M'

In [ ]:
Employees.loc[Employees.MaritalStatus == 'M', ['EmployeeID', 'FirstName', 'LastName', 'MaritalStatus']]

### 2a. Show me a list of employees that have a lastname that begins with "R".

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
	WHERE e.LastName LIKE 'R%';

In [2]:
filter = Employees.LastName.map(lambda x: x[0] == 'R')

In [4]:
filter1 = []
for ln in Employees.LastName:
    if ln[0] == 'R':
        filter1.append(True)
    else:
        filter1.append(False)

Employees[filter1]

,EmployeeID,ManagerID,TerritoryID,Title,FirstName,MiddleName,LastName,Suffix,JobTitle,NationalIDNumber,BirthDate,MaritalStatus,Gender,HireDate,SalariedFlag,VacationHours,SickLeaveHours,PhoneNumber,PhoneNumberType,EmailAddress,AddressLine1,AddressLine2,City,StateProvinceName,PostalCode,CountryName
9,124,250.0,NaN,NaN,Kim,T,Ralls,NaN,Stocker,420776180,1978-06-01,S,F,2003-01-27,0,98,69,309-555-0129,Work,kim0@adventure-works.com,1226 Shoe St.,NaN,Bothell,Washington,98011,United States
10,10,25.0,NaN,NaN,Michael,NaN,Raheem,NaN,Research and Development Manager,879342154,1979-01-01,M,M,2003-06-04,1,16,64,330-555-2568,Work,michael6@adventure-works.com,1234 Seaside Way,NaN,San Francisco,California,94109,United States
16,166,26.0,NaN,NaN,Jack,S,Richins,NaN,Production Supervisor - WC30,60114406,1977-07-23,S,M,2003-03-25,0,68,54,552-555-0111,Work,jack0@adventure-works.com,1356 Grove Way,NaN,Monroe,Washington,98272,United States
27,147,26.0,NaN,NaN,Sandra,NaN,Re√°tegui Alayo,NaN,Production Technician - WC30,604664374,1969-12-06,M,F,2003-01-27,0,37,38,896-555-0168,Work,sandra0@adventure-works.com,1619 Stillman Court,NaN,Seattle,Washington,98104,United States
44,133,26.0,NaN,NaN,Michael,L,Rothkugel,NaN,Production Technician - WC40,830150469,1985-02-04,S,M,2003-02-11,0,70,55,454-555-0119,Work,michael1@adventure-works.com,207 Berry Court,NaN,Edmonds,Washington,98020,United States
95,44,26.0,NaN,NaN,Simon,D,Rapier,NaN,Production Technician - WC60,276751903,1984-06-17,S,M,2003-01-09,0,38,39,963-555-0134,Work,simon0@adventure-works.com,3421 Bouncing Road,NaN,Duvall,Washington,98019,United States
99,65,26.0,NaN,NaN,Randy,T,Reeves,NaN,Production Technician - WC60,8066363,1964-05-29,M,M,2004-03-26,0,29,34,961-555-0122,Cell,randy0@adventure-works.com,3632 Bank Way,NaN,Edmonds,Washington,98020,United States
128,145,26.0,NaN,NaN,Cynthia,S,Randall,NaN,Production Supervisor - WC30,386315192,1975-09-19,S,F,2003-02-28,0,69,54,352-555-0138,Cell,cynthia0@adventure-works.com,463 H Stagecoach Rd.,NaN,Kenmore,Washington,98028,United States
131,149,26.0,NaN,NaN,Andy,M,Ruth,NaN,Production Technician - WC30,764853868,1977-11-20,M,M,2003-03-04,0,39,39,118-555-0110,Cell,andy0@adventure-works.com,4777 Rockne Drive,NaN,Bellevue,Washington,98004,United States
166,74,26.0,NaN,NaN,Bjorn,M,Rettig,NaN,Production Technician - WC30,420023788,1983-12-08,S,M,2003-02-08,0,43,41,199-555-0117,Work,bjorn0@adventure-works.com,5802 Ampersand Drive,NaN,Seattle,Washington,98104,United States
180,71,26.0,NaN,NaN,Michael,Sean,Ray,NaN,Production Supervisor - WC30,578935259,1983-03-02,S,M,2003-03-19,0,70,55,156-555-0199,Cell,michael3@adventure-works.com,6498 Mining Rd.,NaN,Seattle,Washington,98104,United States
188,190,26.0,NaN,NaN,Robert,J,Rounthwaite,NaN,Production Technician - WC45,456839592,1979-04-01,S,M,2003-03-06,0,82,61,589-555-0147,Cell,robert0@adventure-works.com,6843 San Simeon Dr.,NaN,Seattle,Washington,98104,United States
219,157,26.0,NaN,NaN,Linda,A,Randall,NaN,Production Technician - WC20,812797414,1971-11-06,S,F,2003-03-07,0,12,26,696-555-0157,Work,linda1@adventure-works.com,77 Birchwood,NaN,Seattle,Washington,98104,United States
240,279,274.0,5.0,NaN,Tsvi,Michael,Reiter,NaN,Sales Representative,716374314,1968-02-19,M,M,2005-07-01,1,29,34,664-555-0112,Work,tsvi0@adventure-works.com,8291 Crossbow Way,NaN,Memphis,Tennessee,38103,United States
267,252,250.0,NaN,NaN,Arvind,B,Rao,NaN,Buyer,792847334,1968-09-21,M,M,2003-04-01,0,60,50,848-555-0163,Cell,arvind0@adventure-works.com,9495 Limewood Place,NaN,Renton,Washington,98055,United States

In [ ]:
df = Employees[Employees.LastName.map(lambda x: x[0] == 'R')]
df[['EmployeeID', 'FirstName', 'LastName']]

### 2b. Show me a list of employees that have a lastname that ends with "r"

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
	WHERE e.LastName LIKE '%r';

In [ ]:
Employees.loc[Employees.LastName.map(lambda x: x[-1] == 'r'), ['EmployeeID', 'FirstName', 'LastName']]

### 2c. Provide a list of employees that have a hyphenated lastname.

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
	WHERE e.LastName LIKE '%-%';

In [ ]:
help(pd.Series.between)

In [ ]:
type(Employees.LastName)
dir(type(Employees.LastName))

In [ ]:
Employees.loc[Employees.LastName.map(lambda x: '-' in x), ['EmployeeID', 'FirstName', 'LastName']]

### 3a. Provide a list of employees that are on salary and have more than 35 vacation hours left.

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
	FROM dbo.Employees AS e
	WHERE (e.SalariedFlag = 1) AND (e.VacationHours > 35);

In [ ]:
Employees.loc[(Employees.SalariedFlag==1) & (Employees.VacationHours>35), ['EmployeeID', 'FirstName', 'LastName', 'SalariedFlag', 'VacationHours']]

### 3b. Show the same as above but limit it to US employees.

SELECT DISTINCT CountryName FROM dbo.Employees;

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE (e.SalariedFlag = 1) AND (e.VacationHours > 35) AND e.CountryName = 'United States';

In [ ]:
Employees.loc[(Employees.SalariedFlag==1) & (Employees.VacationHours>35), ['EmployeeID', 'FirstName', 'LastName', 'SalariedFlag', 'VacationHours']]

### 3c. Show the same as above but limit it to non-US employees.

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE (e.SalariedFlag = 1) AND (e.VacationHours > 5) AND e.CountryName != 'United States';

In [ ]:
Employees.loc[
    (Employees.SalariedFlag==1) & (Employees.VacationHours>35) & (Employees.CountryName != 'United States')
    , ['EmployeeID', 'FirstName', 'LastName', 'SalariedFlag', 'VacationHours']
]

### 4a. List the married employees with more than 35 vacation hours, only ones living in Washington state.

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
		,e.StateProvinceName
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE e.MaritalStatus = 'M' AND e.VacationHours > 35 AND e.StateProvinceName = 'Washington'
	;

In [ ]:
Employees.loc[
    (Employees.SalariedFlag==1) & (Employees.VacationHours>35) & (Employees.StateProvinceName == 'Washington')
    , ['EmployeeID', 'FirstName', 'LastName', 'SalariedFlag', 'VacationHours', 'StateProvinceName']
]

### 4b. Change the logic to include anyone who meets any of the 3 conditions (i.e., people who are either married, live in Washington state, or have more than 35 vacation hours left)

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.MaritalStatus
		,e.VacationHours
		,e.SalariedFlag
		,e.StateProvinceName
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE e.MaritalStatus = 'M' OR e.VacationHours > 35 OR e.StateProvinceName = 'Washington'
	;

In [ ]:
Employees.loc[
    (Employees.SalariedFlag==1) | (Employees.VacationHours>35) | (Employees.StateProvinceName == 'Washington')
    , ['EmployeeID', 'FirstName', 'LastName', 'SalariedFlag', 'VacationHours', 'StateProvinceName']
]

### 4c. Show the same as above, but only for Production Technicians

SELECT DISTINCT JobTitle FROM dbo.Employees; --- look at job titles

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.MaritalStatus
		,e.JobTitle
		,e.VacationHours
		,e.SalariedFlag
		,e.StateProvinceName
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE e.JobTitle LIKE 'Production Technician%'
		 AND (e.MaritalStatus = 'M' OR e.VacationHours > 35 OR e.StateProvinceName = 'Washington')
	;

In [ ]:
'abc'.startswith('ab')

In [ ]:
Employees.loc[ Employees.JobTitle.map(lambda x: x.startswith('Production Technician'))
    & (
        (Employees.SalariedFlag==1) | (Employees.VacationHours>35) | (Employees.StateProvinceName == 'Washington')
    ), ['EmployeeID', 'FirstName', 'LastName', 'SalariedFlag', 'VacationHours', 'StateProvinceName', 'JobTitle']
]

### 5a. List all employees living in Redmond, Seattle, and Bellevue, showing EmployeeID, FirstName, LastName, and City. Sort the list alphabetically by city.

SELECT e.EmployeeID, e.FirstName, e.LastName, e.City
	FROM dbo.Employees AS e
	WHERE e.City in ('Redmond', 'Seattle', 'Bellevue')
	ORDER BY e.City
	;

In [ ]:
Employees.loc[Employees.City.isin(['Redmond', 'Seattle', 'Bellevue']),
              ['EmployeeID', 'FirstName', 'LastName', 'City']].sort_values('City')

### 5b. For the list above, make sure these are only in the state of Washington, just to be careful.

SELECT e.EmployeeID, e.FirstName, e.LastName, e.City,  e.StateProvinceName
	FROM dbo.Employees AS e
	WHERE e.City in ('Redmond', 'Seattle', 'Bellevue') AND e.StateProvinceName = 'Washington'
	ORDER BY e.City
	;

In [ ]:
Employees.loc[Employees.City.isin(['Redmond', 'Seattle', 'Bellevue'])
              & (Employees.StateProvinceName=='Washington'),
              ['EmployeeID', 'FirstName', 'LastName', 'City']].sort_values('City')

### 6. Provide a list of employees who have no title, whether it's a NULL or empty string.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName
	FROM dbo.Employees AS e
	WHERE e.Title IS NULL OR e.Title = ''
	;

In [ ]:
### Note: when exporting the SQL table to Excel the one row with a ' ' in the Title was already removed...Sorry

Employees.loc[pd.isnull(Employees.Title) | Employees.Title.map(lambda x: len(str(x).strip())==0)
              ,['EmployeeID', 'Title', 'FirstName', 'LastName', 'City']]

### 7a. Provide a list of employees who have at least 60 vacation hours left.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours >= 60
	;

In [ ]:
Employees.loc[Employees.VacationHours >= 60
              , ['EmployeeID', 'FirstName', 'LastName', 'VacationHours', 'SickLeaveHours']]

### 7b. Provide a list of employees who have less than 60 vacation hours left.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours < 60
	;

In [ ]:
Employees.loc[Employees.VacationHours < 60
              , ['EmployeeID', 'FirstName', 'LastName', 'VacationHours', 'SickLeaveHours']]

### 7c. Show me employees who have more than 20 and less than 60 vacation hours left.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours BETWEEN 21 AND 59
	;

In [ ]:
Employees.loc[(Employees.VacationHours > 20) & (Employees.VacationHours < 60)
              , ['EmployeeID', 'FirstName', 'LastName', 'VacationHours', 'SickLeaveHours']]

### 7d. If you did not use BETWEEN for 7c, do the same but use BETWEEN. If you did use BETWEEN for 7c, do it another way.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours > 20 AND  e.VacationHours < 60
	;

In [ ]:
Employees.loc[Employees.VacationHours.between(20, 60, inclusive=False)
              , ['EmployeeID', 'FirstName', 'LastName', 'VacationHours', 'SickLeaveHours']]

# Grouping

### 1a. What is the earliest birthdate for all employees?

SELECT MIN(e.BirthDate) FROM dbo.Employees AS e;

In [ ]:
Employees.BirthDate.min()

### 1b. Add to the above, the most recent birthdate for all employees

SELECT MIN(e.BirthDate) AS 'Earliest Birthday', MAX(e.BirthDate) AS 'Most Reecent Birthday'
	FROM dbo.Employees AS e;

In [ ]:
(Employees.BirthDate.min(), Employees.BirthDate.max())

### 1c. Show the above results broken down by gender

SELECT e.Gender, MIN(e.BirthDate) AS 'Earliest Birthday', MAX(e.BirthDate) AS 'Most Reecent Birthday'
	FROM dbo.Employees AS e
	GROUP BY e.Gender
	;

In [6]:
groups = Employees.Gender.unique()
groups

array(['M', 'F'], dtype=object)

In [5]:
Employees.groupby(by=['Gender']).BirthDate.aggregate([min, max])

               min         max
Gender
F       1946-10-29  1985-07-01
M       1945-11-17  1985-05-07

### 1d. Show the above results broken down by gender, and salaried/hourly

SELECT e.Gender, e.SalariedFlag, MIN(e.BirthDate) AS 'Earliest Birthday', MAX(e.BirthDate) AS 'Most Reecent Birthday'
	FROM dbo.Employees AS e
	GROUP BY e.Gender, e.SalariedFlag
	;

In [ ]:
Employees.groupby(by=['Gender', 'SalariedFlag']).BirthDate.aggregate([min, max])

### 2a. What are the average vacation hours for all employees?

SELECT AVG(e.VacationHours)
	FROM dbo.Employees AS e	
	;

In [ ]:
Employees.VacationHours.mean()

### 2b. Add to the above, the minimum vacation hours for all employees

SELECT AVG(e.VacationHours) AS 'Average Vacation', MIN(e.VacationHours) AS 'Minumum Vacation'
	FROM dbo.Employees AS e	
	;

In [ ]:
(Employees.VacationHours.mean(), Employees.VacationHours.min())

### 2c. Show the above results broken down and ordered by job title

SELECT e.JobTitle, AVG(e.VacationHours) AS 'Average Vacation', MIN(e.VacationHours) AS 'Minimum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle
	;

In [ ]:
Employees.groupby(by=['JobTitle']).VacationHours.aggregate([np.mean, np.min])

### 2d. Show the above results broken down by job title, and married/single employees

SELECT e.JobTitle, e.MaritalStatus, AVG(e.VacationHours) AS 'Average Vacation', MIN(e.VacationHours) AS 'Minimum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle, e.MaritalStatus
	;

In [ ]:
Employees.groupby(by=['JobTitle', 'MaritalStatus']).VacationHours.aggregate([np.mean, np.min])

### 2e. Add to the above, the maximum vacation hours per group

SELECT e.JobTitle, e.MaritalStatus
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle, e.MaritalStatus
	;

In [ ]:
Employees.groupby(by=['JobTitle', 'MaritalStatus']).VacationHours.aggregate([np.mean, np.min, np.max])

### 2f. Show the above results broken down by job title, married/single employees, and State

SELECT e.JobTitle, e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle, e.MaritalStatus, e.StateProvinceName
	;

In [ ]:
Employees.groupby(by=['JobTitle', 'MaritalStatus', 'StateProvinceName']).VacationHours.aggregate([np.mean, np.min, np.max])

### 2g. Show the above results but only for American employees

SELECT e.JobTitle, e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.JobTitle, e.MaritalStatus, e.StateProvinceName
	;

In [ ]:
Employees[Employees.CountryName=='United States'] \
.groupby(by=['JobTitle', 'MaritalStatus', 'StateProvinceName']).VacationHours.aggregate([np.mean, np.min, np.max])

### 2h. Change the grouping above so it's broken down by married/single and State, no more job title

SELECT e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.MaritalStatus, e.StateProvinceName
	;

In [ ]:
Employees[Employees.CountryName=='United States'] \
.groupby(by=['MaritalStatus', 'StateProvinceName']).VacationHours.aggregate([np.mean, np.min, np.max])

### 2i. Limit the results above to States where the average vacation hours is greater than 30

SELECT e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.MaritalStatus, e.StateProvinceName
	HAVING AVG(e.VacationHours) > 30
	;

SELECT e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.StateProvinceName
	HAVING AVG(e.VacationHours) > 30
	;

In [ ]:
Employees[Employees.CountryName=='United States'] \
.groupby(by=['StateProvinceName']).filter(lambda x: x.VacationHours.mean()>30) \
.groupby(by=['StateProvinceName']).VacationHours.aggregate([np.mean, np.min, np.max])

### 2j. Limit the results above to States where the average vacation hours is greater than 30 and the maximum vacation hours is less than 50

SELECT e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.StateProvinceName
	HAVING AVG(e.VacationHours) >30 AND 49 MAX((e.VacationHours) < 50)
	;

In [18]:
Employees[Employees.CountryName=='United States'] \
.groupby(by=['StateProvinceName']).filter(lambda x: (x.VacationHours.mean() >30) and (x.VacationHours.max()<50)) \
.groupby(by=['StateProvinceName']).VacationHours.aggregate([np.mean, np.min, np.max])

                   mean  amin  amax
StateProvinceName
Massachusetts        39    39    39
Michigan             38    38    38
Minnesota            36    24    48

In [24]:
df = Employees[Employees.CountryName=='United States'].groupby(by=['StateProvinceName']).VacationHours.aggregate([np.mean, np.min, np.max])
# df

df[(df['mean'] > 30) & (df['amax'] < 50) ]

                   mean  amin  amax
StateProvinceName
Massachusetts      39.0    39    39
Michigan           38.0    38    38
Minnesota          36.0    24    48

### 2k. Show the same results but only for non-American employees

SELECT e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName != 'United States'
	GROUP BY e.StateProvinceName
	HAVING AVG(e.VacationHours) BETWEEN 31 AND 49
	;

In [ ]:
Employees[Employees.CountryName!='United States'] \
.groupby(by=['StateProvinceName']).filter(lambda x: (x.VacationHours.mean() >30) and (x.VacationHours.max()<50)) \
.groupby(by=['StateProvinceName']).VacationHours.aggregate([np.mean, np.min, np.max])

### 3a. Report how many employees are in the company

SELECT COUNT(1) FROM dbo.Employees;

In [ ]:
Employees.shape[0]

### 3b. For the above report, show the number of employees per manager (hint: use ManagerID)

SELECT e.ManagerID, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.ManagerID
	;

In [ ]:
Employees.groupby(by=['ManagerID']).EmployeeID.aggregate(lambda x: x.shape[0])

### 3c. Remove any manager ID's that are NULL from the results above

SELECT e.ManagerID, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	WHERE e.ManagerID IS NOT NULL
	GROUP BY e.ManagerID
	;

In [ ]:
Employees.loc[pd.isnull(Employees.EmployeeID)==False] \
.groupby(by=['ManagerID']).EmployeeID.aggregate(lambda x: x.shape[0])

### 3d. Show the same results as above, but only for managers who have at least 5 employees

SELECT e.ManagerID, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	WHERE e.ManagerID IS NOT NULL
	GROUP BY e.ManagerID
	HAVING COUNT(1) >= 5
	;

In [ ]:
Employees.loc[pd.isnull(Employees.EmployeeID)==False] \
.groupby(by=['ManagerID']).filter(lambda x: x.shape[0]>=5) \
.groupby(by=['ManagerID']).EmployeeID.aggregate(lambda x: x.shape[0])

### 4a. List the average vacation hours of all employees

SELECT AVG(e.VacationHours)
	FROM dbo.Employees AS e
	;

In [ ]:
Employees.VacationHours.mean()

### 4b. Break down the results by State

SELECT e.StateProvinceName, AVG(e.VacationHours) AS 'Average Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName
	;

In [ ]:
Employees.groupby(by=['StateProvinceName']).VacationHours.mean()

### 4c. Break down the results by city and State

SELECT e.StateProvinceName, e.City, AVG(e.VacationHours) AS 'Average Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	;

In [ ]:
Employees.groupby(by=['StateProvinceName', 'City']).VacationHours.mean()

### 4d. Add something that shows the number of employees per city

SELECT e.StateProvinceName, e.City
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	;

In [ ]:
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean'
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    }
}
Employees.groupby(by=['StateProvinceName', 'City'])\
.aggregate(aggregations)

### 4e. Sort the results by the city and state

SELECT e.StateProvinceName, e.City
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY e.StateProvinceName, e.City
	;

In [ ]:
### Since Pandas already sorts the results, we show here how show resutls in DESCENDING order
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean'
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    }
}
Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations) \
.sort_index(ascending=False, axis=0)

In [ ]:
## This adds the row indices back as columns
df = Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations) \
.sort_index(ascending=False, axis=0)

df['SPN'] = df.index.get_level_values(0)
df['C'] = df.index.get_level_values(1)

### 4f. Make city and State a single column in the format of "City, State"

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY e.StateProvinceName, e.City
	;

In [ ]:
# Version 1: first create new column 'CityState' ... rest is easy
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean'
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    },
}

df = Employees.copy()
df['CityState'] = Employees.City.str.cat(Employees.StateProvinceName, sep=', ')
df.groupby(by = 'CityState').aggregate(aggregations).sort_index(ascending=False, axis=0)

In [ ]:
# Version 2: using the multi-indexed result and adding index values as new column 'CityState'
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean'
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    },
}

df = Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations) \
.sort_index(ascending=False, axis=0)
df['CityState'] = [
    r.City+', '+r.State \
        for i, r in pd.DataFrame({
            'City': df.index.get_level_values(1),
            'State': df.index.get_level_values(0)
            }).iterrows()
    ]
df

### 4g. Add a column that shows the difference between the maximum vacation hours and minimum vacation hours for each city

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY e.StateProvinceName, e.City
	;

In [25]:
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean',
        'MinVacationHours' : min, 
        'MaxVacationHours' : max,
        'DeltaVacationHoues' : lambda x: x.max()-x.min()
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    },
}

Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations) \
.sort_index(ascending=False, axis=0)

/Users/mxz0434/anaconda3/lib/python3.6/site-packages/pandas/core/groupby/groupby.py:4658: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

                                       VacationHours                   \
                                AverageVacationHours MinVacationHours
StateProvinceName City
Washington        Snohomish                52.800000               10
                  Seattle                  54.659091                6
                  Sammamish                42.823529                0
                  Renton                   54.176471                0
                  Redmond                  37.428571                2
                  Newport Hills            62.833333               44
                  Monroe                   47.916667               14
                  Kent                      5.000000                5
                  Kenmore                  53.916667                7
                  Issaquah                 67.666667               10
...                                              ...              ...
Minnesota         Minneapolis              48.000000               48
                  Duluth                   24.000000               24
Michigan          Detroit                  38.000000               38
Massachusetts     Cambridge                39.000000               39
Hamburg           Berlin                   35.000000               35
Gironde           Bordeaux                 34.000000               34
Georgia           Atlanta                  55.000000               55
England           Cambridge                37.000000               37
California        San Francisco            21.000000               16
Alberta           Calgary                  35.000000                9

                                                                     \
                                MaxVacationHours DeltaVacationHoues
StateProvinceName City
Washington        Snohomish                   95                 85
                  Seattle                     95                 89
                  Sammamish                   93                 93
                  Renton                      97                 97
                  Redmond                     94                 92
                  Newport Hills               99                 55
                  Monroe                      85                 71
                  Kent                         5                  0
                  Kenmore                     97                 90
                  Issaquah                    83                 73
...                                          ...                ...
Minnesota         Minneapolis                 48                  0
                  Duluth                      24                  0
Michigan          Detroit                     38                  0
Massachusetts     Cambridge                   39                  0
Hamburg           Berlin                      35                  0
Gironde           Bordeaux                    34                  0
Georgia           Atlanta                     55                  0
England           Cambridge                   37                  0
California        San Francisco               26                 10
Alberta           Calgary                     62                 53

                                  EmployeeID
                                NumEmployees
StateProvinceName City
Washington        Snohomish               10
                  Seattle                 44
                  Sammamish               17
                  Renton                  17
                  Redmond                 21
                  Newport Hills            6
                  Monroe                  12
                  Kent                     1
                  Kenmore                 12
                  Issaquah                15
...                                      ...
Minnesota         Minneapolis              1
                  Duluth                   1
Michigan          Detroit                  1
Massachusetts     Cambridge                1
Hamburg           Berlin                   1
Gironde           Bordeaux                 1
Georgia           Atlanta                  1
England           Cambridge                1
California        San Francisco            2
Alberta           Calgary                  5

[33 rows x 5 columns]

### 4h. Now sort the results by the new column created above

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY 'Difference Vacation Hours' DESC
	;

In [26]:
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean',
        'MinVacationHours' : min, 
        'MaxVacationHours' : max,
        'DeltaVacationHours' : lambda x: x.max()-x.min()
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    },
}

df = Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations)
df.iloc[np.argsort(df['VacationHours']['DeltaVacationHours'])]

/Users/mxz0434/anaconda3/lib/python3.6/site-packages/pandas/core/groupby/groupby.py:4658: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

                                     VacationHours                   \
                              AverageVacationHours MinVacationHours
StateProvinceName City
Oregon            Portland               22.000000               22
England           Cambridge              37.000000               37
Georgia           Atlanta                55.000000               55
Gironde           Bordeaux               34.000000               34
Hamburg           Berlin                 35.000000               35
Massachusetts     Cambridge              39.000000               39
Michigan          Detroit                38.000000               38
Minnesota         Duluth                 24.000000               24
                  Minneapolis            48.000000               48
Ontario           Ottawa                 31.000000               31
...                                            ...              ...
Washington        Snohomish              52.800000               10
                  Seattle                54.659091                6
                  Kenmore                53.916667                7
                  Bothell                65.692308                9
                  Duvall                 42.200000                0
                  Redmond                37.428571                2
                  Sammamish              42.823529                0
                  Bellevue               44.305556                1
                  Renton                 54.176471                0
                  Edmonds                47.640000                1

                                                                    EmployeeID
                              MaxVacationHours DeltaVacationHours NumEmployees
StateProvinceName City
Oregon            Portland                  22                  0            1
England           Cambridge                 37                  0            1
Georgia           Atlanta                   55                  0            1
Gironde           Bordeaux                  34                  0            1
Hamburg           Berlin                    35                  0            1
Massachusetts     Cambridge                 39                  0            1
Michigan          Detroit                   38                  0            1
Minnesota         Duluth                    24                  0            1
                  Minneapolis               48                  0            1
Ontario           Ottawa                    31                  0            1
...                                        ...                ...          ...
Washington        Snohomish                 95                 85           10
                  Seattle                   95                 89           44
                  Kenmore                   97                 90           12
                  Bothell                   99                 90           13
                  Duvall                    92                 92           10
                  Redmond                   94                 92           21
                  Sammamish                 93                 93           17
                  Bellevue                  96                 95           36
                  Renton                    97                 97           17
                  Edmonds                   98                 97           25

[33 rows x 5 columns]

In [27]:
aggregations = {
        'AverageVacationHours' : 'mean',
        'MinVacationHours' : min, 
        'MaxVacationHours' : max,
        'DeltaVacationHours' : lambda x: x.max()-x.min(),
        'NumEmployees' : 'count'
}

df = Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations)
df
# df.iloc[np.argsort(df['VacationHours']['DeltaVacationHours'])]

/Users/mxz0434/anaconda3/lib/python3.6/site-packages/pandas/core/groupby/groupby.py:4658: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

KeyError: 'AverageVacationHours'

### 4i. Limit the results to cities that have more than 1 employee

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	HAVING COUNT(1) > 1
	ORDER BY 'Difference Vacation Hours' DESC
	;

In [ ]:
def my_own_delta(x):
    return  x.max()-x.min()

aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean',
        'MinVacationHours' : np.min, 
        'MaxVacationHours' : np.max,
        'DeltaVacationHours' : my_own_delta, ##lambda x: x.max()-x.min(),
        'cnt' : pd.Series.count
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    },
}

df = Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations)
df['VacationHours']['DeltaVacationHours']>1
df2 = df[df['VacationHours']['DeltaVacationHours']>1]

df2.columns = df2.columns.droplevel(0)
df2.reset_index()
##df2.iloc[np.argsort(df2['VacationHours']['DeltaVacationHours'])]
##np.argsort(df2['VacationHours']['DeltaVacationHours'])

### 4j. Limit the results to non-U.S. cities

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	WHERE e.CountryName != 'United States'
	GROUP BY e.StateProvinceName, e.City
	HAVING COUNT(1) > 1
	ORDER BY 'Difference Vacation Hours' DESC
	;

In [ ]:
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean',
        'MinVacationHours' : min, 
        'MaxVacationHours' : max,
        'DeltaVacationHours' : lambda x: x.max()-x.min()
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    },
}

df = Employees[Employees.CountryName != 'United States'].groupby(by=['StateProvinceName', 'City']).aggregate(aggregations)
df2 = df[df['VacationHours']['DeltaVacationHours']>1]
df2.iloc[np.argsort(df2['VacationHours']['DeltaVacationHours'])]

### Extra
Here are two alternatives to create a 'City, State' column.

In [ ]:
[cs for cs in map(lambda x,y: str(y)+', '+str(x), Employees.StateProvinceName.values, Employees.City.values)]

In [ ]:
Employees.City.str.cat(Employees.StateProvinceName, sep=', ')

# Summary

### In the simplest form one can specify either rows or columns

In [ ]:
# First ten rows
Employees[0:10]

In [ ]:
# Rows satisfying a particular condition
Employees[Employees.MaritalStatus=='M']

In [ ]:
# Select sertain columns
Employees[['EmployeeID', 'FirstName']]

### Since expressions return DataFrames we can chain method calls and [...] operators
The order matters!

In [ ]:
Employees[0:10][Employees.MaritalStatus=='M'][['EmployeeID', 'FirstName', 'MaritalStatus']]

In [ ]:
Employees[Employees.MaritalStatus=='M'][['EmployeeID', 'FirstName', 'MaritalStatus']][0:10]

Recommended to use .loc .iloc .at methods

### Grouping should be performed by on factors (i.e. discrete values), aggregation usually on numeric values.

In [ ]:
Employees.groupby(by=['MaritalStatus']).VacationHours.sum()

### Use 'aggregate' for more complex groupings and aggregations

In [ ]:
aggregations = {
    'VacationHours' : {
        'AverageVacationHours' : 'mean',
        'MinVacationHours' : min, 
        'MaxVacationHours' : max,
        'DeltaVacationHoues' : lambda x: x.max()-x.min()
    },
    'EmployeeID' : {
        'NumEmployees' : 'count'
    },
}

Employees.groupby(by=['StateProvinceName', 'City']).aggregate(aggregations) \
.sort_index(ascending=False, axis=0)

### Assign intermediate results to new variables, and perform next operation on them
In particular to saticfy filtering ('HAVING') and sorting on aggregated values

### Columns are not lists. Methods on columns are defined in Pandas.Series and NumPy

In [ ]:
help(np.min)
help(pd.Series.between)